dagasaurabh/stm32-app/platform/boards/nucleo_l552ze_q/spi/board_spi.c
#include "board_api.h"
#include "spi.h"
#include "spi_driver.h"
#include "gpio.h"
#include "stm32l5xx_hal.h"

static SPI_HandleTypeDef hspi1;

static spi_t spi1_drv = {
    .hal  = &hspi1,
    .name = "spi1",
};

static int board_spi1_open(void *ctx)
{
    (void)ctx;
    return 0;
}

static int board_spi1_close(void *ctx)
{
    (void)ctx;
    return 0;
}

static int board_spi1_transfer_one(void *ctx,
                                    const uint8_t *tx, uint8_t *rx, uint16_t len)
{
    return spi_drv_transfer_one((spi_t *)ctx, tx, rx, len);
}

static int board_spi1_transfer_one_it(void *ctx,
                                       const uint8_t *tx, uint8_t *rx, uint16_t len,
                                       spi_cb_t cb, void *cb_ctx)
{
    /* spi_cb_t and the driver's callback type share the same definition from spi_types.h */
    return spi_drv_transfer_one_it((spi_t *)ctx, tx, rx, len, cb, cb_ctx);
}

static const struct spi_bus_ops spi1_bus_ops = {
    .open           = board_spi1_open,
    .close          = board_spi1_close,
    .transfer_one   = board_spi1_transfer_one,
    .transfer_one_it = board_spi1_transfer_one_it,
};

static struct spi_bus spi1_bus = {
    .name = "spi1",
    .ops  = &spi1_bus_ops,
    .ctx  = &spi1_drv,
};

/* SPI1 IRQ handler — owned here because hspi1 lives here */
void SPI1_IRQHandler(void)
{
    HAL_SPI_IRQHandler(&hspi1);
}

/* Board-level slave pool (shared across all buses on this board)      */

#define BOARD_SPI_MAX_SLAVES 8
static struct spi_slave slave_pool[BOARD_SPI_MAX_SLAVES];
static int slave_count;

void board_spi_init(void)
{
    /* SPI1: master, CPOL=low, CPHA=1-edge, 8-bit, prescaler=16 */
    hspi1.Instance               = SPI1;
    hspi1.Init.Mode              = SPI_MODE_MASTER;
    hspi1.Init.Direction         = SPI_DIRECTION_2LINES;
    hspi1.Init.DataSize          = SPI_DATASIZE_8BIT;
    hspi1.Init.CLKPolarity       = SPI_POLARITY_LOW;
    hspi1.Init.CLKPhase          = SPI_PHASE_1EDGE;
    hspi1.Init.NSS               = SPI_NSS_SOFT;
    hspi1.Init.BaudRatePrescaler = SPI_BAUDRATEPRESCALER_16;
    hspi1.Init.FirstBit          = SPI_FIRSTBIT_MSB;
    hspi1.Init.TIMode            = SPI_TIMODE_DISABLE;
    hspi1.Init.CRCCalculation    = SPI_CRCCALCULATION_DISABLE;
    hspi1.Init.CRCPolynomial     = 7;

    spi_drv_init(&spi1_drv);
    spi_bus_register(&spi1_bus);
}

/*
 * board_spi_add_slave — register a slave device on a named bus.
 *
 * bus_name : must match a registered spi_bus ("spi1", "spi2", …)
 * name     : unique slave name, e.g. "spi1.0", "spi1.1"
 * cs_pin   : GPIO pin used as chip select (active-low, idle-high)
 */
int board_spi_add_slave(const char *bus_name, const char *name, gpio_pin_t cs_pin)
{
    if (!bus_name || !name || slave_count >= BOARD_SPI_MAX_SLAVES) return -1;

    struct spi_slave *s = &slave_pool[slave_count++];
    s->name     = name;
    s->bus_name = bus_name;
    s->cs_pin   = cs_pin;

    /* Drive CS idle-high before the first transfer */
    gpio_init(cs_pin, GPIO_MODE_OUTPUT, GPIO_PULL_NONE);
    gpio_write(cs_pin, GPIO_HIGH);

    return spi_slave_register(s);
}
